#과제: Titanic 데이터를 가지고 5 개의 FE 방법들 직접 사용해보기 (오늘 피피티에 소개되지 않은 FE 방법도 괜찮음)

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# 필요한 모듈 생성

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

# 데이터 불러오기

In [3]:
df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/YBIGTA/교육세션/0719/titanic.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
print(df.shape)
df.head()

(418, 11)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Feature Engineering

# 1. 결측치 확인, 제거, 대체 (Imputation)

## 결측치 확인

In [5]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## 결측치 제거

In [6]:
df_1 = df.dropna()
print("결측치 제거 전 데이터 개수 : ", df.shape[0])
print("결측치 제거 후 데이터 개수 : ", df_1.shape[0])

결측치 제거 전 데이터 개수 :  418
결측치 제거 후 데이터 개수 :  87

In [7]:
# 결측치가 모두 사라진것을 볼 수 있음
df_1.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

## 결측치 대체

In [8]:
# 결측치를 0으로 대체, 데이터 개수는 기존 데이터와 같은 것을 볼 수 있음
df_2 = df.fillna(0)
print("결측치 대체 전 데이터 개수 : ", df.shape[0])
print("결측치 대체 후 데이터 개수 : ", df_2.shape[0])

결측치 대체 전 데이터 개수 :  418
결측치 대체 후 데이터 개수 :  418

In [9]:
# 결측치를 Mean or Median으로 대체
df_3 = df.fillna(df.mean())
df_4 = df.fillna(df.median())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

In [10]:
# 결측치를 가장 빈도수가 높은 값으로 대체
print(df['Age'].value_counts())
print(df['Fare'].value_counts())
print(df['Cabin'].value_counts())

21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
76.0     1
28.5     1
22.5     1
62.0     1
38.5     1
Name: Age, Length: 79, dtype: int64
7.7500     21
26.0000    19
13.0000    17
8.0500     17
7.8958     11
           ..
7.8208      1
8.5167      1
78.8500     1
52.0000     1
22.3583     1
Name: Fare, Length: 169, dtype: int64
B57 B59 B63 B66    3
B45                2
C89                2
C55 C57            2
A34                2
                  ..
E52                1
D30                1
E31                1
C62 C64            1
C105               1
Name: Cabin, Length: 76, dtype: int64

- 결측치가 존재하는 Feature에서 가장 빈도수가 높은 unique 값
    - Age : 21.0
    - Fare : 7.7500
    - Cabin : B57

In [11]:
# 빈도수가 높은 값으로 채워줌
df_5 = df.copy()
df_5.loc[df['Age'] != df['Age'],'Age'] = 21.0
df_5.loc[df['Fare'] != df['Fare'],'Fare'] = 7.7500
df_5.loc[df['Cabin'] != df['Cabin'],'Cabin'] = 'B57'

In [12]:
print(df['Age'].value_counts())
print(df_5['Age'].value_counts())

21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
76.0     1
28.5     1
22.5     1
62.0     1
38.5     1
Name: Age, Length: 79, dtype: int64
21.0    103
24.0     17
22.0     16
30.0     15
18.0     13
       ...
76.0      1
28.5      1
22.5      1
62.0      1
38.5      1
Name: Age, Length: 79, dtype: int64

- 결측치를 빈도수가 가장 높았던 21.0으로 대체함으로써, 21.0 값의 개수가 늘었음을 확인할 수 있음

In [13]:
# 결측치를 임의의 값으로 대체
df_6 = df.fillna(method = 'pad')
df_7 = df.fillna(method = 'bfill')

# 2. 지표 변수 (Indicator Variables)

In [14]:
df['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [15]:
oldness = []
for a in df['Age']:
    if (0 <= a <= 30):
        oldness.append('Young')
    elif (31 <= a <= 50):
        oldness.append('Middle')
    else:
        oldness.append('Old')

df['Oldness'] = oldness

In [16]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Oldness
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Middle
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Middle
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Old
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Young
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Young

# 3. 스케일링 (Scaling)

In [17]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
mm_scaler = MinMaxScaler()
sd_scaler = StandardScaler()

In [18]:
# MinMax Scaling
mm_scaler = mm_scaler.fit_transform(df['Age'].values.reshape(-1,1))
df['mm_scaled_Age'] = mm_scaler

# Standard Scaling
sd_scaler = sd_scaler.fit_transform(df['Age'].values.reshape(-1,1))
df['sd_scaled_Age'] = sd_scaler

In [19]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Oldness,mm_scaled_Age,sd_scaled_Age
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Middle,0.452723,0.298549
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Middle,0.617566,1.181328
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Old,0.815377,2.240662
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Young,0.353818,-0.231118
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Young,0.287881,-0.584229
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,Old,NaN,NaN
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,Middle,0.512066,0.616350
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Middle,0.505473,0.581038
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,Old,NaN,NaN
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,Old,NaN,NaN

# 4. 라벨 인코딩 (Label Encoding)

In [20]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [21]:
encoded = encoder.fit_transform(df['Embarked'])

In [22]:
df['Embarked_class'] = encoded

In [23]:
df.Embarked_class.value_counts()

2    270
0    102
1     46
Name: Embarked_class, dtype: int64

# 5. 원-핫 인코딩 (One-Hot Encoding)

In [24]:
pd.get_dummies(df['Embarked'])

     C  Q  S
0    0  1  0
1    0  0  1
2    0  1  0
3    0  0  1
4    0  0  1
..  .. .. ..
413  0  0  1
414  1  0  0
415  0  0  1
416  0  0  1
417  1  0  0

[418 rows x 3 columns]